; domain
(define (domain c-d-farmbot)

; this domain is tried with popf planner, simple and esterel parser and dispatchers
; esterel dispatcher will not work because some action wkll be dispatched concurrently rather than sequentially 
; use simple dispatcher
; the popf is unable to produce optimal plan on the first iteration. However, we can wait for it to iterate on the plan. but it takes time
(:requirements 
    :strips 
    :fluents 
    ; :durative-actions
    :typing 
    ; :timed-initial-literals 
    :conditional-effects 
    ; :negative-preconditions 
    ; :duration-inequalities 
    ; :equality 
    ; :disjunctive-preconditions
    ; :universal-preconditions
    ; :existential-preconditions

)

(:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
    
    position
    plant seed weed - object
    ;sucker sprayhead blade camera sensor container - tool
    tool
    toolrack
    level
    container ; seed container
    bin
    
)

; un-comment following line if constants are needed
;(:constants )

(:predicates ;todo: define predicates here
    (farmbot-functioning)
    (tool-mount-free)
    (farmbot-at ?x - position)
    (carry-tool ?t - tool)
    ; (visited ?x - position)
    (carry-camera)

    (tool-at ?x - position ?t - tool)
    (tool-rack-at ?tr - toolrack ?t - tool ?x - position)

    (no-plant-at ?x - position)
    (plant-at ?x - position ?p - plant)

    (weed-at ?x - position ?w - weed)
    (no-weed-at ?x - position)
    (check-weed-exist ?x - position)

    (carry-seed ?s - seed)
    (seeder-free)

    (container-at ?x - position ?c - container)
    (container-has ?c - container ?s - seed)
    (match-seed-n-plant ?s - seed ?p - plant)

    (bin-at ?x - position ?b - bin)

    (checked-moisture ?x - position ?p - plant)
    (need-water ?x - position ?p - plant)
    (not-need-water ?x - position ?p - plant)
    (watered ?x - position ?p - plant)
)

(:constants
    low high - level
    seeder wateringnozzle weeder soilsensor - tool
    seedtray - container
    seedbin - bin
    seederrack wateringnozzlerack weederrack soilsensorrack - toolrack
    seederPos wateringnozzlePos weederPos soilsensorPos posSeedTray posBin - position
)


(:functions
    (remaining-seed ?c - container ?s - seed)
)

(:action move
    :parameters (?x ?y - position)
    :precondition (and 
        (farmbot-at ?x)
        (farmbot-functioning)
    )
    :effect (and 
        (not (farmbot-at ?x))
        (farmbot-at ?y)
    )
)


(:action pick_up_tool
    :parameters (?x - position ?t - tool)
    :precondition (and 
    
        (tool-at ?x ?t)
        (tool-mount-free)
        (farmbot-at ?x)
        (farmbot-functioning)
  
    )
    :effect (and 
      
        (not (tool-mount-free))
        (not (tool-at ?x ?t))
        (carry-tool ?t)

    )
)

(:action put_down_tool
    :parameters (?x - position ?t - tool ?tr - toolrack)
    :precondition (and 
      
        (carry-tool ?t)
        (tool-rack-at ?tr ?t ?x)
        (farmbot-at ?x)
        (farmbot-functioning)

    )
    :effect (and 
    
        (not (carry-tool ?t)) 
        (tool-mount-free)
        (tool-at ?x ?t)

    )
)


(:action drop_seed
    :parameters (?x - position ?s - seed)
    :precondition (and 

        (bin-at ?x seedbin)
        (farmbot-at ?x)
        (farmbot-functioning)

    )
    :effect (and 

        (seeder-free)

    )
)


(:action pick_up_seed
    :parameters (?x - position ?s - seed ?c - container)
    :precondition (and 

        (container-has ?c ?s)
        (seeder-free)
        (> (remaining-seed ?c ?s) 0)
        (container-at ?x ?c)
        (farmbot-at ?x)
        (farmbot-functioning)
        (carry-tool seeder)
    )
    :effect (and 

        (not (seeder-free))
        (carry-seed ?s)
        (decrease (remaining-seed ?c ?s) 1)
    )
)

(:action place_seed
    :parameters (?x - position ?s - seed ?p - plant)
    :precondition (and 
       
        (no-plant-at ?x)
        (carry-seed ?s)

        (farmbot-at ?x)
        (match-seed-n-plant ?s ?p)
        (farmbot-functioning)
        (carry-tool seeder)
 
    )
    :effect (and 

        (not (carry-seed ?s))
        (not (no-plant-at ?x))
        (seeder-free)

    
        (plant-at ?x ?p)      

    )
)

(:action check_need_water
    :parameters (?x - position ?p - plant)
    :precondition (and 

        (plant-at ?x ?p)
        (farmbot-at ?x)
        (carry-tool soilsensor)
        (farmbot-functioning)

    )
    :effect (and 
 
        (checked-moisture ?x ?p)
        (not (watered ?x ?p)); this is very important to enable the APP to cycle between two state, otherwise the goal will already be satisfied the second time it comes back to water plan

    )

    ; update the KB in the actual action dispatch and feedback unit
    ; if the need-water predicate needs to be added, based on the result from the moisture sensor
)

(:action water_plant
    :parameters (?x - position ?p - plant)
    :precondition (and 
   
        (need-water ?x ?p)

        (farmbot-at ?x)
        (plant-at ?x ?p)
        (carry-tool wateringnozzle)
        (farmbot-functioning)
   
    )
    :effect (and 

        (not (need-water ?x ?p))
        (not (checked-moisture ?x ?p))

        (watered ?x ?p)
   
    )
)


(:action skip_water_plant
    :parameters (?x - position ?p - plant)

    :precondition (and 

        (not-need-water ?x ?p)

        (plant-at ?x ?p)
        (farmbot-functioning)
    

    )
    :effect (and 

        (not (not-need-water ?x ?p)) 
        (not (checked-moisture ?x ?p))

        (watered ?x ?p)

    )
)


(:action detect_weed
    :parameters (?x - position)
    :precondition (and 
        (carry-camera)
        (farmbot-at ?x)
        (farmbot-functioning)
        

    )
    :effect (and 
        (check-weed-exist ?x)
    )
)

(:action remove_weed 
    :parameters (?x - position ?w - weed) ; while updating the kb, we have to add the instance ?w - w1, w2, w3 etc.
    :precondition (and 
        (farmbot-at ?x)
        (farmbot-functioning)
        (carry-tool weeder)
        (weed-at ?x ?w)
    )
    :effect (and 
        (no-weed-at ?x)
    )
)



)

; problem
(define (problem initial-state) (:domain c-d-farmbot)
(:objects 
    home A1 A2 A3 A4 A5 A6 A7 - position
    carrotSeed basilSeed parsleySeed - seed
    carrot basil parsley - plant
)

(:init
    (farmbot-functioning)
    (farmbot-at home)
    (carry-camera)
    (tool-mount-free)
    (seeder-free)

    (tool-rack-at seederrack seeder seederPos)
    (tool-rack-at wateringnozzlerack wateringnozzle wateringnozzlePos)
    (tool-rack-at weederrack weeder weederPos)
    (tool-rack-at soilsensorrack soilsensor soilsensorPos)

    (tool-at seederPos seeder)
    (tool-at wateringnozzlePos wateringnozzle)
    (tool-at weederPos weeder)
    (tool-at soilsensorPos soilsensor)

    (container-at posSeedTray seedtray)
    (container-has seedtray carrotSeed)                              
    (container-has seedtray basilSeed)
    (container-has seedtray parsleySeed)

    (= (remaining-seed seedtray carrotSeed) 2)
    (= (remaining-seed seedtray basilSeed) 1)
    (= (remaining-seed seedtray parsleySeed) 1)

    (bin-at posBin seedbin)

    (match-seed-n-plant carrotSeed carrot)
    (match-seed-n-plant basilSeed basil)
    (match-seed-n-plant parsleySeed parsley)

    (no-plant-at A1)
    (no-plant-at A2)
    (no-plant-at A3)
    (no-plant-at A4)
    (no-plant-at A5)
    (no-plant-at A6)
    (no-plant-at A7)


)

(:goal (and
    ; (plant-at A1 carrot)
    ; (plant-at A3 basil)
    ; (plant-at A5 carrot)
    ; (plant-at A6 parsley)
    (farmbot-at home)
    (tool-mount-free)
    ; (visited A1)
    ; (visited A2)
    ;todo: put the goal condition here
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (move home seederpos)
   deleted: (farmbot-at home)
   added: (farmbot-at seederpos)
   goals met: 1 of 2
2. (pick_up_tool seederpos seeder)
   deleted: (tool-mount-free) (tool-at seederpos seeder)
   added: (carry-tool seeder)
   goals met: 0 of 2
3. (move seederpos posseedtray)
   deleted: (farmbot-at seederpos)
   added: (farmbot-at posseedtray)
   goals met: 0 of 2
4. (pick_up_seed posseedtray parsleyseed seedtray)
   deleted: (seeder-free)
   added: (carry-seed parsleyseed)
   changed: (remaining-seed seedtray parsleyseed) from 1 to 0
   goals met: 0 of 2
5. (move posseedtray a6)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at a6)
   goals met: 0 of 2
6. (place_seed a6 parsleyseed parsley)
   deleted: (carry-seed parsleyseed) (no-plant-at a6)
   added: (seeder-free) (plant-at a6 parsley)
   goals met: 0 of 2
7. (move a6 posseedtray)
   deleted: (farmbot-at a6)
   added: (farmbot-at posseedtray)
   goals met: 0 of 2
8. (pick_up_seed posseedtray basilseed seedtray)
   deleted: (seeder-free)
   added: (carry-seed basilseed)
   changed: (remaining-seed seedtray basilseed) from 1 to 0
   goals met: 0 of 2
9. (move posseedtray a3)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at a3)
   goals met: 0 of 2
10. (place_seed a3 basilseed basil)
   deleted: (carry-seed basilseed) (no-plant-at a3)
   added: (seeder-free) (plant-at a3 basil)
   goals met: 0 of 2
11. (move a3 posseedtray)
   deleted: (farmbot-at a3)
   added: (farmbot-at posseedtray)
   goals met: 0 of 2
12. (pick_up_seed posseedtray carrotseed seedtray)
   deleted: (seeder-free)
   added: (carry-seed carrotseed)
   changed: (remaining-seed seedtray carrotseed) from 2 to 1
   goals met: 0 of 2
13. (move posseedtray a5)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at a5)
   goals met: 0 of 2
14. (place_seed a5 carrotseed carrot)
   deleted: (carry-seed carrotseed) (no-plant-at a5)
   added: (seeder-free) (plant-at a5 carrot)
   goals met: 0 of 2
15. (move a5 posseedtray)
   deleted: (farmbot-at a5)
   added: (farmbot-at posseedtray)
   goals met: 0 of 2
16. (pick_up_seed posseedtray carrotseed seedtray)
   deleted: (seeder-free)
   added: (carry-seed carrotseed)
   changed: (remaining-seed seedtray carrotseed) from 1 to 0
   goals met: 0 of 2
17. (move posseedtray a1)
   deleted: (farmbot-at posseedtray)
   added: (farmbot-at a1)
   goals met: 0 of 2
18. (place_seed a1 carrotseed carrot)
   deleted: (carry-seed carrotseed) (no-plant-at a1)
   added: (seeder-free) (plant-at a1 carrot)
   goals met: 0 of 2
19. (move a1 seederpos)
   deleted: (farmbot-at a1)
   added: (farmbot-at seederpos)
   goals met: 0 of 2
20. (put_down_tool seederpos seeder seederrack)
   deleted: (carry-tool seeder)
   added: (tool-mount-free) (tool-at seederpos seeder)
   goals met: 1 of 2
21. (move seederpos home)
   deleted: (farmbot-at seederpos)
   added: (farmbot-at home)
   goals met: 2 of 2
